Revit 2024 API
StructuralConnectionSettings Class
 Provides access to project-wide structural connections settings.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public class StructuralConnectionSettings : Element
Visual Basic
Public Class StructuralConnectionSettings _
	Inherits Element
Visual C++
public ref class StructuralConnectionSettings : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.StructuralConnectionSettings
See Also
StructuralConnectionSettings Members
Autodesk.Revit.DB.Structure Namespace